read_liberty NangateOpenCellLibrary_typical.lib
read_verilog netlist_final_opt.v
link_design async_fifo
read_sdc constrain.sdc



